{
  "name": "AlphaPulse AI",
  "description": "An AI-powered stock intelligence platform designed to bridge the cognitive gap in trading. It aggregates real-time data, social sentiment, and earnings news to provide authoritative, actionable signals for high-potential opportunities.",
  "raw_requirement": "I want to build an stock monitoring Android app, the app can proactively monitor real time stock price and changes, stock company earning news and results, stock related twitter account announcements, and highly related influencer and leadership’s social media posts, like twitter post, and send active notification to me for the stocks that I registered into my interest list, but also for a carefully selected and limited stocks that I didn’t register, but has a very good potential for profit (whether it’s by doing buy orders or sell orders), the notification should be very succinct but to the point, once clicked, it will open the app and goes to a page with all the related information, the buy/sell price, timing, confidence and whatever metrics and information that you think is important for me to make a buy or sell decision. I’d like to explain the core idea of this app to you so that you can internalize it during the design of the app. I think for many people doing stock trading, they are limited by their own cognitive limitations, for example, 2025 is the year of AI, and there have been many opportunities in the stock market this year to gain tremendous profit, NVIDIA is the obvious one, but there is also electricity company stocks like CEG, OKLO, memory/disk stocks like MU, Sandisk, and related stocks like AMD, AVGO etc, besides AI, there is also quantum computing stocks like QBTS, RGTI that also increased X times within a short amount of time, if one can catch such opportunities, they will get incredible returns. But due to the cognitive limitation, when such a trend starts in the early time, you might not have the courage to buy enough stocks for a profit, I like to browser social platforms like xiaohongshu and twitter to see post, especially post from insightful person about the stocks they recommend, and their analysis of the market, but often those post won’t really strike me, I wouldn’t believe too much about it, or paying much attention to it, which has cause a lot of opportunities to slip away, so I think this app can help me more authoritatively identify such opportunities and gather the right information to convince me about the opportunities, instead of me get lost in so many posts from different people, I’d like to have this app condense the information, analysis it using AI, and render it in the right format for me to quickly consume and help me to make the decision. Eventually, I’d like to make this app connect with my brokerage account so that I can quickly make the trades within the app.",
  "requestFramePermissions": []
}